AcDbAuditInfo.updateObject(AcDbHandle,System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.Boolean,AcRxClass*,AcRxClass*,AcDbObjectId)
updateObject is invoked from AcDb Recover and Audit internals, and can
also be invoked from AcDbObject::audit(), dwgInFields() and any other
override members invoked during a recover operation and its subsequent
audit.
setFileObjIsValid:
Boolean indicating whether the fileObjIsValid parameter should
replace the corresponding field in the lookup table entry.
setNewObjIsValid:
Boolean indicating whether the newObjIsValid parameter should
replace the corresponding field in the lookup table entry.
setFileObjClass:
Boolean indicating whether the fileObjClass parameter should
replace the corresponding field in the lookup table entry.
setNewObjClass:
Boolean indicating whether the setNewObjClass parameter should
replace the corresponding field in the lookup table entry.
setNewObjId:
Boolean indicating whether the newObjId parameter should
replace the corresponding field in the lookup table entry.
fileObjIsValid:
A bool indicating whether the object image in the DWG file was
valid or not.
newObjIsValid:
A bool indicating whether the object under newObjId is
valid or not.   If not set to true, then fetchObject on
objectHandle will return eNullObjectPointer.
pFileObjClass:
The original class of the missing or corrupted object.
pNewObjClass:
The class of the original or replacement object.
newObjId:
Boolean indicating whether the newObjId parameter should
replace the corresponding field in the lookup table entry.
Usually that of objectHandle unless the object id had to
be redirected.
Returns:
The following ErrorStatus values can be returned from this function.
eOk:                   Success, the indicated fields were replaced.
eInvalidInput:         The input handle cannot be null (0).
Remarks:
The Recover logic makes use of this member to indicated fixed up
objects and redirected object ids.  But it can be invoked by
applications as well.
This is the most powerful and most verbose way to create and update
entries for the indirect object lookup table; with a separate parameter
for every field in a table entry, and a boolean flag for each parameter,
indicating whether the corresponding parameter should replace the current
entry or not.

AcDbAuditInfo.registerObject(AcDbHandle,System.Boolean,AcRxClass*)
registerObject is invoked from AcDb Recover and Audit internals, and can
also be invoked from AcDbObject::audit(), dwgInFields() and any other
override members invoked during a recover operation and its subsequent
audit.   It is the easy way to make entries for valid objects, compared
to AcDbAuditInfo::updateObject, which has a much more verbose parameter
list.
handle:
The handle of the original object, readily obtainable from an object
id as well.  It is the lookup key for indirect object lookup table
entries.
objIsValid:
A bool indicating whether the object is valid or not.  If true is
passed in, then the entire lookup table entry is filled out with
the handle pointing to its own object id as its replacement.
pObjClass:
The anticipated or known class of the missing-corrupted object.
Returns:
The following ErrorStatus values can be returned from this function.
eOk:                   Success, objId has a valid value.
eInvalidInput:         The input handle cannot be null (0).
eHandleInUse:          Returned if this function is invoked more than
once for the input handle in a single recover
operation.
Remarks:
The Recover logic usually populates the indirect object table
with entries that map object ids to themselves.   But it can be invoked by
applications as well.
Once objIsValid is passed in as false, AcDbAuditInfo::updateObject
must be invoked to establish the new object id.

AcDbAuditInfo.fetchObject(AcDbObjectId,AcDbObjectId*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,AcRxClass*,System.Boolean,System.Boolean,System.Boolean)
fetchObject is invoked from AcDbObject::audit() override members, as
well as the AcDb recovery-audit complex.   Its purpose is to retrieve
an object id based on the input object id.   It will usually be the
same object id as is passed in, but can differ when recover logic
creates new objects under new object ids.
originalObjId:
The object id read in from the DWG file.
newObjId:
The object id to use insetad of originalObjId.
pObjClass:
The anticipated class of the missing-corrupted object.
uneraseIfPossible:
If true, and the referenced object is erased, it will be
unerased if the object permits itself to be unerased.
createIfNotFound:
Every call to fetchObject with this parameter set to true will
cause the object recreation mechanism to be invoked.
if false, then fetchObject will return results based on what is
already in the lookup table.
externalDbOk:
true implies that objId and newObjId can reside in another database.
Note:  Not yet implemented.
Returns:
The following ErrorStatus values can be returned from this function.
eOk:                   Success, objId has a valid valuel
eInvalidInput:         Errors include newObjId being NULL and pObjClass
being NULL.
eNotImplementedYet:    returned if externalDbOk is true and newObjId is
from an external database.
eInvalidXrefObjectId:  objId cannot be a forwarding reference to another
object Id in an xref database.
eWasErased:            if an object is erased and the uneraseIfPossible
parameter is false or the object cannot be unerased.
eNullObjectPointer and
eNullObjectId:         if a valid object cannot be returned for various
reasons.
Remarks:
If eOk is returned, then newObjId will be valid and should be used (and
will most often be the same as objId).
If any other value is returned, then both objId and newObjId should be
considered to be invalid.